bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N17A.atdf
        <module name="PORT" id="U2210" version="2.1.1">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41000000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="62" function="default" pad="PB30"/>
              <signal group="P" index="63" function="default" pad="PB31"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
            </signals>
            <parameters>
              <param name="BITS" value="93"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="3"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="3.2.0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42005800"/>
            <signals>
              <signal group="X" index="0" function="B" pad="PA08"/>
              <signal group="X" index="1" function="B" pad="PA09"/>
              <signal group="X" index="2" function="B" pad="PA10"/>
              <signal group="X" index="3" function="B" pad="PA11"/>
              <signal group="X" index="4" function="B" pad="PA16"/>
              <signal group="X" index="5" function="B" pad="PA17"/>
              <signal group="X" index="6" function="B" pad="PA18"/>
              <signal group="X" index="7" function="B" pad="PA19"/>
              <signal group="X" index="8" function="B" pad="PA20"/>
              <signal group="X" index="9" function="B" pad="PA21"/>
              <signal group="X" index="10" function="B" pad="PA22"/>
              <signal group="X" index="11" function="B" pad="PA23"/>
              <signal group="X" index="12" function="B" pad="PB12"/>
              <signal group="X" index="13" function="B" pad="PB13"/>
              <signal group="X" index="14" function="B" pad="PB14"/>
              <signal group="X" index="15" function="B" pad="PB15"/>
              <signal group="Y" index="0" function="B" pad="PA02"/>
              <signal group="Y" index="1" function="B" pad="PA03"/>
              <signal group="Y" index="2" function="B" pad="PA04"/>
              <signal group="Y" index="3" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA07"/>
              <signal group="Y" index="6" function="B" pad="PB00"/>
              <signal group="Y" index="7" function="B" pad="PB01"/>
              <signal group="Y" index="8" function="B" pad="PB02"/>
              <signal group="Y" index="9" function="B" pad="PB03"/>
              <signal group="Y" index="10" function="B" pad="PB04"/>
              <signal group="Y" index="11" function="B" pad="PB05"/>
              <signal group="Y" index="12" function="B" pad="PB06"/>
              <signal group="Y" index="13" function="B" pad="PB07"/>
              <signal group="Y" index="14" function="B" pad="PB08"/>
              <signal group="Y" index="15" function="B" pad="PB09"/>
              <signal group="Y" index="16" function="B" pad="PA08"/>
              <signal group="Y" index="17" function="B" pad="PA09"/>
              <signal group="Y" index="18" function="B" pad="PA10"/>
              <signal group="Y" index="19" function="B" pad="PA11"/>
              <signal group="Y" index="20" function="B" pad="PA16"/>
              <signal group="Y" index="21" function="B" pad="PA17"/>
              <signal group="Y" index="22" function="B" pad="PA18"/>
              <signal group="Y" index="23" function="B" pad="PA19"/>
              <signal group="Y" index="24" function="B" pad="PA20"/>
              <signal group="Y" index="25" function="B" pad="PA21"/>
              <signal group="Y" index="26" function="B" pad="PA22"/>
              <signal group="Y" index="27" function="B" pad="PA23"/>
              <signal group="Y" index="28" function="B" pad="PB12"/>
              <signal group="Y" index="29" function="B" pad="PB13"/>
              <signal group="Y" index="30" function="B" pad="PB14"/>
              <signal group="Y" index="31" function="B" pad="PB15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="46" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="48" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="47" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="37" caption="Index of Generic Clock"/>
              <param name="X_LINES_NUM" value="16" caption="Number of X lines"/>
              <param name="Y_LINES_NUM" value="32" caption="Number of Y lines"/>
              <param name="SELF_CAP_CHANNELS_NUM" value="32" caption="Number of self-capacitance channels"/>
              <param name="MUTUAL_CAP_CHANNELS_NUM" value="256" caption="Number of mutual-capacitance channels"/>
              <param name="INSTANCE_ID" value="86"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="2.0.2">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="EXTWAKE" index="0" function="A" pad="PA00"/>
              <signal group="EXTWAKE" index="1" function="A" pad="PA01"/>
              <signal group="EXTWAKE" index="2" function="A" pad="PA02"/>
              <signal group="EXTWAKE" index="3" function="A" pad="PA03"/>
              <signal group="EXTWAKE" index="4" function="A" pad="PA04"/>
              <signal group="EXTWAKE" index="5" function="A" pad="PA05"/>
              <signal group="EXTWAKE" index="6" function="A" pad="PA06"/>
              <signal group="EXTWAKE" index="7" function="A" pad="PA07"/>
              <signal group="EXTWAKE" index="8" function="A" pad="PA08"/>
              <signal group="EXTWAKE" index="9" function="A" pad="PA09"/>
              <signal group="EXTWAKE" index="10" function="A" pad="PA10"/>
              <signal group="EXTWAKE" index="11" function="A" pad="PA11"/>
              <signal group="EXTWAKE" index="12" function="A" pad="PA12"/>
              <signal group="EXTWAKE" index="13" function="A" pad="PA13"/>
              <signal group="EXTWAKE" index="14" function="A" pad="PA14"/>
              <signal group="EXTWAKE" index="15" function="A" pad="PA15"/>
            </signals>
            <parameters>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2250" version="1.1.0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="ALARM_NUM" value="1" caption="Number of Alarms"/>
              <param name="COMP16_NUM" value="2" caption="Number of 16-bit Comparators"/>
              <param name="COMP32_NUM" value="1" caption="Number of 32-bit Comparators"/>
              <param name="GPR_NUM" value="0" caption="Number of General-Purpose Registers"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="SDADC" id="U2260" version="1.0.1">
          <instance name="SDADC">
            <register-group name="SDADC" name-in-module="SDADC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="INN" index="0" function="B" pad="PA06"/>
              <signal group="INN" index="1" function="B" pad="PB08"/>
              <signal group="INN" index="2" function="B" pad="PB06"/>
              <signal group="INP" index="0" function="B" pad="PA07"/>
              <signal group="INP" index="1" function="B" pad="PB09"/>
              <signal group="INP" index="2" function="B" pad="PB07"/>
              <signal group="VREFP" function="B" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="44" caption="Index of DMA RESRDY trigger"/>
              <param name="EXT_CHANNELS" value="3" caption="Number of external channels"/>
              <param name="GCLK_ID" value="35" caption="Index of generic clock"/>
              <param name="INSTANCE_ID" value="83"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="3.2.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="0" function="C" pad="PB24"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="1" function="C" pad="PB25"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PB22"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PC24"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PB23"/>
              <signal group="PAD" index="3" function="C" pad="PC25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="2" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="3" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="19"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC27"/>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PB30"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="D" pad="PC28"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PB31"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="4" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="5" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="20"/>
              <param name="GCLK_ID_SLOW" value="18"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
