bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N17A.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PC03"/>
              <signal group="WO" index="0" function="F" pad="PA20"/>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="F" pad="PA21"/>
              <signal group="WO" index="1" function="F" pad="PC05"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="0" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="24" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="25" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="26" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="29" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="PG" value="0" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="TSENS" id="U2261" version="1.0.1">
          <instance name="TSENS">
            <register-group name="TSENS" name-in-module="TSENS" address-space="base" offset="0x40003000"/>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="1" caption="Index of DMA RESRDY trigger"/>
              <param name="GCLK_ID" value="5" caption="Index of Generic Clock"/>
              <param name="INSTANCE_ID" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="31" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="2" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC" caption="System peripherals shared interrupt"/>
        <interrupt name="WDT" index="1" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC" index="2" module-instance="RTC" caption="Real Time Counter"/>
        <interrupt name="EIC" index="3" module-instance="EIC" caption="External Interrupt Controller"/>
        <interrupt name="FREQM" index="4" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="TSENS" index="5" module-instance="TSENS" caption="Temperature Sensor"/>
        <interrupt name="NVMCTRL" index="6" module-instance="NVMCTRL" caption="Non-Volatile Memory Controller"/>
        <interrupt name="DMAC" index="7" module-instance="DMAC" caption="Direct Memory Controller"/>
        <interrupt name="EVSYS" index="8" module-instance="EVSYS" caption="Event Systems"/>
        <interrupt name="SERCOM0_6" index="9" module-instance="SERCOM0 SERCOM6" caption="Serial Communication Interface 0_6"/>
        <interrupt name="SERCOM1_7" index="10" module-instance="SERCOM1 SERCOM7" caption="Serial Communication Interface 1_7"/>
        <interrupt name="SERCOM2" index="11" module-instance="SERCOM2" caption="Serial Communication Interface 2"/>
        <interrupt name="SERCOM3" index="12" module-instance="SERCOM3" caption="Serial Communication Interface 3"/>
        <interrupt name="SERCOM4" index="13" module-instance="SERCOM4" caption="Serial Communication Interface 4"/>
        <interrupt name="SERCOM5" index="14" module-instance="SERCOM5" caption="Serial Communication Interface 5"/>
        <interrupt name="CAN0" index="15" module-instance="CAN0" caption="Control Area Network 0"/>
        <interrupt name="CAN1" index="16" module-instance="CAN1" caption="Control Area Network 1"/>
        <interrupt name="TCC0" index="17" module-instance="TCC0" caption="Timer/Counter for Control Applications 0"/>
        <interrupt name="TCC1" index="18" module-instance="TCC1" caption="Timer/Counter for Control Applications 1"/>
        <interrupt name="TCC2" index="19" module-instance="TCC2" caption="Timer/Counter for Control Applications 2"/>
        <interrupt name="TC0_5" index="20" module-instance="TC0 TC5" caption="Timer/Counter 0_5"/>
        <interrupt name="TC1_6" index="21" module-instance="TC1 TC6" caption="Timer/Counter 1_6"/>
        <interrupt name="TC2_7" index="22" module-instance="TC2 TC7" caption="Timer/Counter 2_7"/>
        <interrupt name="TC3" index="23" module-instance="TC3" caption="Timer/Counter 3"/>
        <interrupt name="TC4" index="24" module-instance="TC4" caption="Timer/Counter 4"/>
        <interrupt name="ADC0" index="25" module-instance="ADC0" caption="Analog-to-Digital Converter 0"/>
        <interrupt name="ADC1" index="26" module-instance="ADC1" caption="Analog-to-Digital Converter 1"/>
        <interrupt name="AC" index="27" module-instance="AC" caption="Analog Comparators"/>
        <interrupt name="DAC" index="28" module-instance="DAC" caption="Digital-to-Analog Converter"/>
        <interrupt name="SDADC" index="29" module-instance="SDADC" caption="Sigma-Delat Analog-to-Digital Converter"/>
        <interrupt name="PTC" index="30" module-instance="PTC" caption="Peripheral Touch Controller"/>
      </interrupts>
      <events>
        <generators>
          <generator name="OSCCTRL_XOSC_FAIL" index="1" module-instance="OSCCTRL"/>
          <generator name="OSC32KCTRL_XOSC32K_FAIL" index="2" module-instance="OSC32KCTRL"/>
          <generator name="RTC_CMP_0" index="3" module-instance="RTC"/>
          <generator name="RTC_CMP_1" index="4" module-instance="RTC"/>
          <generator name="RTC_OVF" index="5" module-instance="RTC"/>
          <generator name="RTC_PER_0" index="6" module-instance="RTC"/>
          <generator name="RTC_PER_1" index="7" module-instance="RTC"/>
          <generator name="RTC_PER_2" index="8" module-instance="RTC"/>
          <generator name="RTC_PER_3" index="9" module-instance="RTC"/>
          <generator name="RTC_PER_4" index="10" module-instance="RTC"/>
          <generator name="RTC_PER_5" index="11" module-instance="RTC"/>
          <generator name="RTC_PER_6" index="12" module-instance="RTC"/>
          <generator name="RTC_PER_7" index="13" module-instance="RTC"/>
          <generator name="EIC_EXTINT_0" index="14" module-instance="EIC"/>
          <generator name="EIC_EXTINT_1" index="15" module-instance="EIC"/>
          <generator name="EIC_EXTINT_2" index="16" module-instance="EIC"/>
          <generator name="EIC_EXTINT_3" index="17" module-instance="EIC"/>
          <generator name="EIC_EXTINT_4" index="18" module-instance="EIC"/>
          <generator name="EIC_EXTINT_5" index="19" module-instance="EIC"/>
          <generator name="EIC_EXTINT_6" index="20" module-instance="EIC"/>
          <generator name="EIC_EXTINT_7" index="21" module-instance="EIC"/>
          <generator name="EIC_EXTINT_8" index="22" module-instance="EIC"/>
          <generator name="EIC_EXTINT_9" index="23" module-instance="EIC"/>
          <generator name="EIC_EXTINT_10" index="24" module-instance="EIC"/>
          <generator name="EIC_EXTINT_11" index="25" module-instance="EIC"/>
          <generator name="EIC_EXTINT_12" index="26" module-instance="EIC"/>
          <generator name="EIC_EXTINT_13" index="27" module-instance="EIC"/>
          <generator name="EIC_EXTINT_14" index="28" module-instance="EIC"/>
          <generator name="EIC_EXTINT_15" index="29" module-instance="EIC"/>
          <generator name="TSENS_WINMON" index="30" module-instance="TSENS"/>
          <generator name="DMAC_CH_0" index="31" module-instance="DMAC"/>
          <generator name="DMAC_CH_1" index="32" module-instance="DMAC"/>
          <generator name="DMAC_CH_2" index="33" module-instance="DMAC"/>
          <generator name="DMAC_CH_3" index="34" module-instance="DMAC"/>
          <generator name="TCC0_OVF" index="35" module-instance="TCC0"/>
          <generator name="TCC0_TRG" index="36" module-instance="TCC0"/>
          <generator name="TCC0_CNT" index="37" module-instance="TCC0"/>
          <generator name="TCC0_MC_0" index="38" module-instance="TCC0"/>
          <generator name="TCC0_MC_1" index="39" module-instance="TCC0"/>
          <generator name="TCC0_MC_2" index="40" module-instance="TCC0"/>
          <generator name="TCC0_MC_3" index="41" module-instance="TCC0"/>
          <generator name="TCC1_OVF" index="42" module-instance="TCC1"/>
          <generator name="TCC1_TRG" index="43" module-instance="TCC1"/>
          <generator name="TCC1_CNT" index="44" module-instance="TCC1"/>
          <generator name="TCC1_MC_0" index="45" module-instance="TCC1"/>
          <generator name="TCC1_MC_1" index="46" module-instance="TCC1"/>
          <generator name="TCC2_OVF" index="47" module-instance="TCC2"/>
          <generator name="TCC2_TRG" index="48" module-instance="TCC2"/>
          <generator name="TCC2_CNT" index="49" module-instance="TCC2"/>
          <generator name="TCC2_MC_0" index="50" module-instance="TCC2"/>
          <generator name="TCC2_MC_1" index="51" module-instance="TCC2"/>
          <generator name="TC0_OVF" index="52" module-instance="TC0"/>
          <generator name="TC0_MC_0" index="53" module-instance="TC0"/>
          <generator name="TC0_MC_1" index="54" module-instance="TC0"/>
          <generator name="TC1_OVF" index="55" module-instance="TC1"/>
          <generator name="TC1_MC_0" index="56" module-instance="TC1"/>
          <generator name="TC1_MC_1" index="57" module-instance="TC1"/>
          <generator name="TC2_OVF" index="58" module-instance="TC2"/>
          <generator name="TC2_MC_0" index="59" module-instance="TC2"/>
          <generator name="TC2_MC_1" index="60" module-instance="TC2"/>
          <generator name="TC3_OVF" index="61" module-instance="TC3"/>
          <generator name="TC3_MC_0" index="62" module-instance="TC3"/>
          <generator name="TC3_MC_1" index="63" module-instance="TC3"/>
          <generator name="TC4_OVF" index="64" module-instance="TC4"/>
          <generator name="TC4_MC_0" index="65" module-instance="TC4"/>
          <generator name="TC4_MC_1" index="66" module-instance="TC4"/>
          <generator name="ADC0_RESRDY" index="67" module-instance="ADC0"/>
          <generator name="ADC0_WINMON" index="68" module-instance="ADC0"/>
          <generator name="ADC1_RESRDY" index="69" module-instance="ADC1"/>
          <generator name="ADC1_WINMON" index="70" module-instance="ADC1"/>
          <generator name="SDADC_RESRDY" index="71" module-instance="SDADC"/>
          <generator name="SDADC_WINMON" index="72" module-instance="SDADC"/>
          <generator name="AC_COMP_0" index="73" module-instance="AC"/>
          <generator name="AC_COMP_1" index="74" module-instance="AC"/>
          <generator name="AC_COMP_2" index="75" module-instance="AC"/>
          <generator name="AC_COMP_3" index="76" module-instance="AC"/>
          <generator name="AC_WIN_0" index="77" module-instance="AC"/>
          <generator name="AC_WIN_1" index="78" module-instance="AC"/>
          <generator name="DAC_EMPTY" index="79" module-instance="DAC"/>
          <generator name="CCL_LUTOUT_0" index="82" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_1" index="83" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_2" index="84" module-instance="CCL"/>
          <generator name="CCL_LUTOUT_3" index="85" module-instance="CCL"/>
          <generator name="PAC_ACCERR" index="86" module-instance="PAC"/>
          <generator name="TC5_OVF" index="88" module-instance="TC5"/>
          <generator name="TC5_MC_0" index="89" module-instance="TC5"/>
          <generator name="TC5_MC_1" index="90" module-instance="TC5"/>
          <generator name="TC6_OVF" index="91" module-instance="TC6"/>
          <generator name="TC6_MC_0" index="92" module-instance="TC6"/>
          <generator name="TC6_MC_1" index="93" module-instance="TC6"/>
          <generator name="TC7_OVF" index="94" module-instance="TC7"/>
          <generator name="TC7_MC_0" index="95" module-instance="TC7"/>
          <generator name="TC7_MC_1" index="96" module-instance="TC7"/>
        </generators>
        <users>
          <user name="TSENS_START" index="0" module-instance="TSENS"/>
          <user name="PORT_EV_0" index="1" module-instance="PORT"/>
          <user name="PORT_EV_1" index="2" module-instance="PORT"/>
          <user name="PORT_EV_2" index="3" module-instance="PORT"/>
          <user name="PORT_EV_3" index="4" module-instance="PORT"/>
          <user name="DMAC_CH_0" index="5" module-instance="DMAC"/>
          <user name="DMAC_CH_1" index="6" module-instance="DMAC"/>
          <user name="DMAC_CH_2" index="7" module-instance="DMAC"/>
          <user name="DMAC_CH_3" index="8" module-instance="DMAC"/>
          <user name="TCC0_EV_0" index="9" module-instance="TCC0"/>
          <user name="TCC0_EV_1" index="10" module-instance="TCC0"/>
          <user name="TCC0_MC_0" index="11" module-instance="TCC0"/>
          <user name="TCC0_MC_1" index="12" module-instance="TCC0"/>
          <user name="TCC0_MC_2" index="13" module-instance="TCC0"/>
          <user name="TCC0_MC_3" index="14" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="15" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="16" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="17" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="18" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="19" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="20" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="21" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="22" module-instance="TCC2"/>
          <user name="TC0_EVU" index="23" module-instance="TC0"/>
          <user name="TC1_EVU" index="24" module-instance="TC1"/>
          <user name="TC2_EVU" index="25" module-instance="TC2"/>
          <user name="TC3_EVU" index="26" module-instance="TC3"/>
          <user name="TC4_EVU" index="27" module-instance="TC4"/>
          <user name="ADC0_START" index="28" module-instance="ADC0"/>
          <user name="ADC0_SYNC" index="29" module-instance="ADC0"/>
          <user name="ADC1_START" index="30" module-instance="ADC1"/>
          <user name="ADC1_SYNC" index="31" module-instance="ADC1"/>
          <user name="SDADC_START" index="32" module-instance="SDADC"/>
          <user name="SDADC_FLUSH" index="33" module-instance="SDADC"/>
          <user name="AC_SOC_0" index="34" module-instance="AC"/>
          <user name="AC_SOC_1" index="35" module-instance="AC"/>
          <user name="AC_SOC_2" index="36" module-instance="AC"/>
          <user name="AC_SOC_3" index="37" module-instance="AC"/>
          <user name="DAC_START" index="38" module-instance="DAC"/>
          <user name="CCL_LUTIN_0" index="40" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="41" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="42" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="43" module-instance="CCL"/>
          <user name="MTB_START" index="45" module-instance="MTB"/>
          <user name="MTB_STOP" index="46" module-instance="MTB"/>
          <user name="TC5_EVU" index="47" module-instance="TC5"/>
          <user name="TC6_EVU" index="48" module-instance="TC6"/>
          <user name="TC7_EVU" index="49" module-instance="TC7"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x11011421"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
