bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N17A.atdf
      <value-group name="EIC_CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE4">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="EVSYS" id="U2256" version="1.1.0" caption="Event System Interface">
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="CHSTATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Channel Status">
          <bitfield name="USRRDY0" caption="Channel 0 User Ready" mask="0x1"/>
          <bitfield name="USRRDY1" caption="Channel 1 User Ready" mask="0x2"/>
          <bitfield name="USRRDY2" caption="Channel 2 User Ready" mask="0x4"/>
          <bitfield name="USRRDY3" caption="Channel 3 User Ready" mask="0x8"/>
          <bitfield name="USRRDY4" caption="Channel 4 User Ready" mask="0x10"/>
          <bitfield name="USRRDY5" caption="Channel 5 User Ready" mask="0x20"/>
          <bitfield name="USRRDY6" caption="Channel 6 User Ready" mask="0x40"/>
          <bitfield name="USRRDY7" caption="Channel 7 User Ready" mask="0x80"/>
          <bitfield name="USRRDY8" caption="Channel 8 User Ready" mask="0x100"/>
          <bitfield name="USRRDY9" caption="Channel 9 User Ready" mask="0x200"/>
          <bitfield name="USRRDY10" caption="Channel 10 User Ready" mask="0x400"/>
          <bitfield name="USRRDY11" caption="Channel 11 User Ready" mask="0x800"/>
          <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x10000"/>
          <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x20000"/>
          <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x40000"/>
          <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x80000"/>
          <bitfield name="CHBUSY4" caption="Channel 4 Busy" mask="0x100000"/>
          <bitfield name="CHBUSY5" caption="Channel 5 Busy" mask="0x200000"/>
          <bitfield name="CHBUSY6" caption="Channel 6 Busy" mask="0x400000"/>
          <bitfield name="CHBUSY7" caption="Channel 7 Busy" mask="0x800000"/>
          <bitfield name="CHBUSY8" caption="Channel 8 Busy" mask="0x1000000"/>
          <bitfield name="CHBUSY9" caption="Channel 9 Busy" mask="0x2000000"/>
          <bitfield name="CHBUSY10" caption="Channel 10 Busy" mask="0x4000000"/>
          <bitfield name="CHBUSY11" caption="Channel 11 Busy" mask="0x8000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection" mask="0x8000000"/>
        </register>
        <register name="SWEVT" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1"/>
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2"/>
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4"/>
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8"/>
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10"/>
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20"/>
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40"/>
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80"/>
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100"/>
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200"/>
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400"/>
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800"/>
        </register>
        <register name="CHANNEL" offset="0x20" rw="RW" size="4" count="12" initval="0x00008000" caption="Channel n">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F"/>
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="EVSYS_CHANNEL__PATH"/>
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="EVSYS_CHANNEL__EDGSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000"/>
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000"/>
        </register>
        <register name="USER" offset="0x80" rw="RW" size="4" count="50" initval="0x00000000" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x1F"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="SYNCHRONOUS" caption="Synchronous path" value="0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="1"/>
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="2"/>
      </value-group>
    </module>
    <module name="FREQM" id="U2257" version="2.0.0" caption="Frequency Meter">
      <register-group name="FREQM" caption="Frequency Meter">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B Register">
          <bitfield name="START" caption="Start Measurement" mask="0x1"/>
        </register>
